OpenFOAMExamples/Tube/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// block definition for a porosity with an angled inlet/outlet
// the porosity is not aligned with the main axes
//
                             
convertToMeters 0.001;

vertices
(
    // inlet region
    ( -88.9  0  -50.8 )  // pt 0 (in1b) 
    ( -88.9 50.8  0 ) // pt 1 (in2b) 
    ( -88.9  -50.8  0 )  // pt 2 (in1f) 
    ( -88.9 0  50.8 ) // pt 3 (in2f) 

    // join inlet->outlet
    (  88.9 0 -50.8) // pt 4 (join1b) 
    (  88.9  50.8 0 ) // pt 5 (join2b) 
    (  88.9 -50.8 0 )    // pt 6 (join1f) 
    (  88.9  0 50.8 ) // pt 7 (join2f) 

);

blocks
(
    // inlet block
    hex (0 4 5 1 2 6 7 3)
    inlet ( 60 60 60 ) simpleGrading (1 1 1)

   
);

edges
(
    arc 1 0 (-88.9 35.92 -35.92)
    arc 0 2 (-88.9 -35.92 -35.92)
    arc 2 3 (-88.9 -35.92 35.92)
    arc 3 1 (-88.9 35.92 35.92)
    arc 5 4 (88.9 35.92 -35.92)
    arc 4 6 (88.9 -35.92 -35.92)
    arc 6 7 (88.9 -35.92 35.92)
    arc 7 5 (88.9 35.92 35.92)
    
);

patches
(
    // is there no way of defining all my 'defaultFaces' to be 'wall'?
    wall front
    (
    // inlet block
    (2 6 7 3)
    )

    wall back
    (
    // inlet block
    (1 5 4 0)
    )

    wall walls
    (
    // inlet block
    (2 0 4 6)
    (7 5 1 3)
    )

    patch inlet
    (
    (3 1 0 2)
    )

    patch outlet
    (
    (7 5 4 6)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
